app/controllers/polls_controller.rb

INSERT INTO "polls" ("title", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["title", "Sample Poll"], ["created_at", "2024-11-29 09:05:40.140678"], ["updated_at", "2024-11-29 09:05:40.140678"]]
---
  def create
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save

UPDATE "polls" SET "title" = ?, "updated_at" = ? WHERE "polls"."id" = ?  [["title", "Updated Title"], ["updated_at", "2024-11-29 09:05:40.199123"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @poll.update(poll_params)

DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]
---
  def destroy
    @poll.destroy!

SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_poll
    @poll = Poll.find(params.expect(:id))